{
  "id": "factor-crafter",
  "name": "Factor Crafter",
  "category": "math",
  "categoryName": "Math",
  "source": "Itch.io",
  "url": "https://playcebo.itch.io/factor-crafter",
  "embedUrl": "https://playcebo.itch.io/factor-crafter",
  "ageRange": "10-14",
  "difficulty": "Medium",
  "crawledAt": "2025-06-12T17:06:18.691Z",
  "info": {
    "title": "Factor Crafter",
    "description": "Welcome to the world of Factor Crafter, where elemental stones obey the laws of multiplication. Prime numbers form the basic elements, and can be combined together to create composites.\n Fill up your almanac as you multiply  Prime gems and factor Composite stones.\nFeatures: 40 levels, an almanac of 100 stones, Sandbox mode, and Endless mode.\nTopics: Multiplication, factorization, Common Multiples, Common Factors, logarithms, and variables.\nAccessibility: Sound is optional. No time limits. Mouse-only. Strong English-reading ability is recommended.\nU.S. Standards: This game covers most of common core standard 4.OA.B.4 (4th grade), 6.NS.B.4  (6th grade), introductory algebra concepts (8th grade), and logarithms (11th grade). SFX from soundeffectsplus.com, pacdv.com, and soundimage.org.\nInstall Instructions:\nWebGL (Browser, Chromebook) Extract files, then open \"index\" file to run in web browser. [This has not been tested on Chromebooks, but it probably works.]\nWindows PC: Extract files, then open \"Factor Crafter\" executable file to run.\nAndroid: As this game is not purchased from an app store, you may be warned that the file is \"not from an authorized source\", or \"potentially unsafe\". You may need to   edit your settings to \"install apps from unknown sources\". The installable .apk file is  typically stored in your  \"Downloads\" folder. Do a web search for 'install apk on [your Android device]' for more information.",
    "tags": [],
    "rating": null,
    "plays": null,
    "features": [],
    "objectives": []
  },
  "images": [
    "factor-crafter-intro-2.jpg",
    "factor-crafter-intro-3.jpg",
    "factor-crafter-intro-4.jpg"
  ],
  "screenshots": [
    "factor-crafter-main.jpg"
  ],
  "instructions": {
    "controls": [
      "使用鼠标点击进行操作",
      "使用键盘方向键移动"
    ],
    "howToPlay": "按照游戏内提示进行游戏，完成各种挑战任务。",
    "objectives": [
      "完成游戏目标",
      "提升相关技能"
    ],
    "tips": [],
    "rules": []
  }
}